// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

let userInfo = {
    name: "Ihor",
    age: 30,
    "like suka": true,
}
console.log(userInfo);
console.log(userInfo['name']);
console.log(userInfo['like suka']);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Імена властивостей об'єкта 
let userInfo = {
    name: "Ihor",
    age: 30,
    "like suka": true,
};
console.log(userInfo);
console.log(userInfo['name']);
console.log(userInfo['like suka']);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Вичисляєме чи передаваєме ім'я 
let firstPart = "likes";
let userInfo = {
    name: "Ihor",
    age: 32,
    [firstPart + " suka"]: true,
};
console.log(userInfo["likes suka"]);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// передаєм ім'я 
let firstPart = "likes";
let userInfo = {
    name: "Ihor",
    age: 32,
    [firstPart]: true,
};
console.log(userInfo[firstPart]);
let key = "name"; // перевага квадратних скобок
console.log(userInfo[key]);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// создаєм символ id з описом (іменем)  "id"
let id = Symbol("id");
let userInfo = {
    name: "Ihor",
    age: 32,
    [id]: "suka",
};
console.log(userInfo);
console.log(userInfo[id]);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// вложеность
let userInfo = {
    name: "Ihor",
    age: 32,
    address: {
        cyty: "Kyiv",
        street: "Url",
    } 
};
console.log(userInfo);
console.log(userInfo.address);
console.log(userInfo.address.cyty);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// витяг властивостей із змінних
function makeUserInfo(name, age) {
    return {
        name: name,
        age: age,
        // .....
    };
}
let user = makeUserInfo("Ihor", 32);
console.log(user);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ЗМІНА ВЛАСТИВОСТЕЙ

// ДОДВАВАННЯ властивостей
let userInfo = {
    name: "Ihor",
}
console.log(userInfo);
// додаєм нову властивість - вік - 32 годіка
userInfo.age = 32;
console.log(userInfo);
// додаєм літеральну властивість, можливво із 2-х і більше слів
userInfo['like suka'] = true;
console.log(userInfo);
// додавання об'єкта в об'єкт
userInfo.address = {
    cyty: "Kyiv",
    street: "Url",
};
console.log(userInfo);
//  видалення властивостей
delete userInfo.age
console.log(userInfo);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ЗМІНА ВЛАСТИВОСТЕЙ (мінять значення можна даже в константах)
let userInfo = {
    name: "Ihor",
    age: 32,
};
// console.log(userInfo);
// // зміна віку
userInfo.age = 18;
console.log(userInfo);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ДУБЛІРУВАННЯ (копіювання) об'єктів через Object.assing
// синтаксис 
// Object.assign(куди(об'єкт), що(властивість №1), що(властивість №2), .....)
let userInfo = {
    name: "Ihor",
    age: 32,
};
let newUser = Object.assign({}, userInfo);
newUser.age = 18;
console.log(userInfo);
console.log(newUser);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------
// додавання нових значеннь через Object.assign
let userInfo = {
    name: "Ihor",
    age: 32,
};
Object.assign(userInfo, {['like suka']: true, cyty: 'Kyiv'});
console.log(userInfo);
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// перевірка існування властивостей
let userInfo = {
    name: "Ihor",
    // age: 32,
};
// console.log(userInfo.age);
if (userInfo.age) {
    console.log(userInfo.age);
}
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------
// перевірка існування властивостей ОПЦІОНАЛЬНИЙ ЛАНЦЮГ
let userInfo = {
    name: "Ihor",
    age: 32,
    address: {
        city: 'Kyiv',
        street: 'Url',
    }
};
console.log(userInfo?.address?.street); // якщо ми удалим adres - street і виведем в консоль без "?", то отримаєм помилку куда, щоб цого не було треба ставить ?
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// оператор in
let userInfo = {
    name: "Ihor",
    age: 32,
    address: {
        city: 'Kyiv',
        street: 'Url',
    }
};
if ('name' in userInfo) {
    console.log(userInfo.name);
}
// ---------------------------------------------------------------------------------------------------
let userInfo = {
    name: undefined,
};
// if (userInfo.name) { // false
//     console.log(userInfo.name);
// }
if ('name' in userInfo) { // true
    console.log(userInfo.name);
}
// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------

// // +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// // цикл for in
let userInfo = {
    name: "Ihor",
    age: 32,
    address: {
        city: 'Kyiv',
        street: 'Url',
    }
};
for (let key in userInfo) {
    // ключі
    console.log(key); // name, age, address
    // значення ключів
    console.log(userInfo[key]); // Ihor, 32, Object {city: 'Kyiv', street: 'Url'...}
}
for (let key in userInfo.address) {
    // ключі
    console.log(key); // city, street
    // значення ключів
    console.log(userInfo.address[key]); // Kyiv, Url...}
}
// // ---------------------------------------------------------------------------------------------------
// // ---------------------------------------------------------------------------------------------------

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// методи об'єкта
let userInfo = {
    name: "Ihor",
    age: 32,
    address: {
        city: 'Kyiv',
        street: 'Url',
    },
    // showInfo: function () { // "довгий запис функції"
    //     console.log(`звусь я ${userInfo.name}, мені ${userInfo.age} роки. Адрес: м.${userInfo.address.city}, вул.${userInfo.address.street}`);
    // }
    showInfo () { // "скорочений запис функції"
        // console.log(`звусь я ${userInfo.name}, мені ${userInfo.age} роки. Адрес: м.${userInfo.address.city}, вул.${userInfo.address.street}`);
        // // використання методу this замість userInfo....варто пом'ятати, то this звертається до батьківського об'єкту, якщо буд функція у функції запис this видасть еррор
        console.log(`звусь я ${this.name}, мені ${this.age} роки. Адрес: м.${this.address.city}, вул.${this.address.street}`);
    }    
};
userInfo.showInfo();
// // ---------------------------------------------------------------------------------------------------
// // ---------------------------------------------------------------------------------------------------


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// функція КОНСТРУКТОР
// правила: 1. ім'я ф-ції пишеться з великої літери (для розробників); 2. функція конструктори повинна викликатися за доп. оператора "new"
function UserInfo(name) {
    this.name = name;
    this.age = 32;
}
console.log(new UserInfo('Ihor'));
console.log(new UserInfo('Nastya'));
// // ---------------------------------------------------------------------------------------------------
// // ---------------------------------------------------------------------------------------------------


