// // УМОВА ЗАВДАННЯ +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// // 29.1 Об'єкти/ МІНІМУМ/ Створи об'єкт, що описує автомобіль:
// •	виробник, 
// •	модель, 
// •	рік випуску, 
// •	середня швидкість, 
// •	обсяг паливного бака, 
// •	середня витрата палива на 100 км., 
// •	водії,
//      
//      і наступні функції для роботи з цим об'єктом:
// 1. Висновок на екран з інформацією про автомобіль.
// 2. Додавання водія, який має право керувати автомобілем.
// 3. Заправка автомобіля.
// 4. Підрахунок необхідного часу для подолання переданої відстані з середньою швидкістю.
// •	Враховуй, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину,
//         а також потрібно перевіряти чи має право водій керувати даним автомобілем(ім'я водія функція приймає другим аргументом). 
// •	Також потрібно перевірити чи вистачить палива, для здійснення цієї поїздки,
//         якщо палива не вистачить потрібно вивести повідомлення, про це і запропонувати заправити автомобіль.
// // +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

let carInfo = {
    manufacturer: "mitsubishi",
    model: "colt",
    "graduation year": 2007,
    "average speed, kph": 113,
    "volume of the fuel tank, liters": 47,
    "average fuel consumption per 100 km.": 6.3,
    "drivers": "Ihor",

    showCarInfo() {
        console.log(`(${this.manufacturer})`);
    } 
};

carInfo.showCarInfo();
// console.log(carInfo);



// let time = 7;
// let print = "0" + time;
// console.log(print.slice(-2));

