// 27.1 min // Запитай у користувача його вік і визначи, ким він є: дитиною (0-2), підлітком (12-18), дорослим (18_60) або пенсіонером (60 ...), передбач можливість введення невірних даних.
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// let yourAge = 123;
// let massage = (yourAge <= 12) ? 'You are a child, what are you doing here?' :
//     (yourAge <= 18) ? 'You are a tinager' :
//     (yourAge < 60) ? 'You are an adult' :
//             'Are You retired or probably dead?';
// console.log(massage);



// 27.2 min // Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// let yourNumber = 2;
// let simbol = (yourNumber == 1) ? '!' :
//     (yourNumber == 2) ? '@' :
//     (yourNumber == 3) ? '#' :
//     (yourNumber == 4) ? '$' :  
//     (yourNumber == 5) ? '%' :
//     (yourNumber == 6) ? '^' :
//     (yourNumber == 7) ? '&' :
//     (yourNumber == 8) ? '*' :
//     (yourNumber == 9) ? '(' :
//     ')' ;
// console.log(simbol);

// 27.3 main // Підрахуй суму всіх чисел в заданому користувачем діапазоні.
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// let startRange = 2;
// let endRange = 4;
// let sum = 0;
//   while(startRange <= endRange) {       
//     sum += startRange;  
//     startRange++;
//   }
// console.log(sum);


// 27.4 min // Запитай у користувача 2 числа і знайди найбільший спільний дільник.
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------



// 27.5 min // Запитай у користувача число і виведи всі дільники цього числа.
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


// ---------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------
